app/controllers/vehicles_controller.rb

  def show
    @vehicle = Vehicle.find(params[:id])
---
SELECT "vehicles".* FROM "vehicles" WHERE "vehicles"."id" = ? LIMIT 1  [["id", "980190962"]]

  def edit
    @vehicle = Vehicle.find(params[:id])
---
SELECT "vehicles".* FROM "vehicles" WHERE "vehicles"."id" = ? LIMIT 1  [["id", "980190962"]]

  def create
    engine = Engine.where(:model => params[:vehicle][:engine_id] )
    params[:vehicle][:engine_id] = engine.first.id
    @vehicle = Vehicle.new(params[:vehicle])

    respond_to do |format|
      if @vehicle.save
---
INSERT INTO "vehicles" ("created_at", "occupants", "payload_weight", "type", "updated_at", "v_identifier") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Wed, 11 Dec 2013 06:07:05 UTC +00:00], ["occupants", 1], ["payload_weight", 1.5], ["type", nil], ["updated_at", Wed, 11 Dec 2013 06:07:05 UTC +00:00], ["v_identifier", 1]]

  def update
    @vehicle = Vehicle.find(params[:id])
---
SELECT "vehicles".* FROM "vehicles" WHERE "vehicles"."id" = ? LIMIT 1  [["id", "980190962"]]

  def destroy
    @vehicle = Vehicle.find(params[:id])
    if @vehicle.construction.delivery_date < Time.now
      respond_to do |format|
        if @vehicle.destroy
---
SELECT "vehicles".* FROM "vehicles" WHERE "vehicles"."id" = ? LIMIT 1  [["id", "980190962"]]
DELETE FROM "vehicles" WHERE "vehicles"."id" = ?  [["id", 980190962]]